jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32F767/FS_NOR_PHY_STM32F767.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File    : FS_NOR_PHY_STM32F767.c
Purpose : NOR physical layer for the internal flash memory of ST STM32F767.
Literature:
  [1] RM0410 Reference manual STM32F76xxx and STM32F77xxx advanced ARM-based 32-bit MCUs
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F7\RM0410_STM32F76xxx_STM32F77xxx_Rev2_DM00224583.pdf)
  [2] STM32F765xx STM32F767xx STM32F768Ax STM32F769xx Data sheet
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F7\DS11532_STM32F765xx_STM32F767xx_STM32F768Ax_STM32F769xx_Datasheet_Rev4.pdf)
  [2] STM32F76xxx STM32F77xxx Errata sheet
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F7\STM32F76xxx_STM32F77xxx_Errata_Rev4.pdf)
  [4]  UM1974 User manual STM32 Nucleo-144 board
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F7\EvalBoard\NUCLEO-F767ZI\UM1974_en.DM00244518.pdf)
Additional information:
  This physical layer expects that the parameters of the internal flash
  memory such as number of wait states and the dual bank mode are already
  configured correctly.

  The FS_NOR_PHY_MAX_NUM_BYTES define must be is set according to the supply
  voltage of the MCU as described in the following table taken from [2]

  Supply voltage   FS_NOR_PHY_MAX_NUM_BYTES
  (V)              (bytes)
  -----------------------------------------
  2.7 - 3.6        4
  2.1 - 2.7        2
  1.8 - 2.1        1
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"
#include <stm32f767xx.h>

/*********************************************************************
*
*       Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_PHY_MAX_NUM_BYTES
  #define FS_NOR_PHY_MAX_NUM_BYTES      4   // Maximum number of bytes that can be written at once.
#endif

/*********************************************************************
*
*       Defines, fixed
*
**********************************************************************
*/

/*********************************************************************
*
*       FLASH registers
*/
#define FLASH_BASE_ADDR         0x40023C00
#define FLASH_ACR               (*(volatile U32*)(FLASH_BASE_ADDR + 0x00))
#define FLASH_KEYR              (*(volatile U32*)(FLASH_BASE_ADDR + 0x04))
#define FLASH_OPTKEYR           (*(volatile U32*)(FLASH_BASE_ADDR + 0x08))
#define FLASH_SR                (*(volatile U32*)(FLASH_BASE_ADDR + 0x0C))
#define FLASH_CR                (*(volatile U32*)(FLASH_BASE_ADDR + 0x10))
#define FLASH_OPTCR             (*(volatile U32*)(FLASH_BASE_ADDR + 0x14))

/*********************************************************************
*
*       System Control Block
*/
#define SCB_BASE_ADDR           0xE000E000uL
#define SCB_CCR                 (*(volatile U32 *)(SCB_BASE_ADDR + 0xD14))    // Configuration Control Register

/*********************************************************************
*
*       Memory protection unit
*/
#define MPU_BASE_ADDR           0xE000ED90uL
#define MPU_TYPE                (*(volatile U32 *)(MPU_BASE_ADDR + 0x00))
#define MPU_CTRL                (*(volatile U32 *)(MPU_BASE_ADDR + 0x04))
#define MPU_RNR                 (*(volatile U32 *)(MPU_BASE_ADDR + 0x08))
#define MPU_RBAR                (*(volatile U32 *)(MPU_BASE_ADDR + 0x0C))
#define MPU_RASR                (*(volatile U32 *)(MPU_BASE_ADDR + 0x10))

/*********************************************************************
*
*       Misc. registers
*/
#define SYS_FSIZE               (*(volatile U16*)(0x1FF0F442))

/*********************************************************************
*
*       Flash control register
*/
#define CR_PG_BIT               0     // Start programming
#define CR_SER_BIT              1
#define CR_SNB_BIT              3
#define CR_SNB_MASK             0x1FuL
#define CR_PSIZE_BIT            8
#define CR_PSIZE_8              0uL
#define CR_PSIZE_16             1uL
#define CR_PSIZE_32             2uL
#define CR_PSIZE_MASK           0x3uL
#define CR_STRT_BIT             16
#define CR_EOPIE_BIT            24
#define CR_ERRIE_BIT            25
#define CR_LOCK_BIT             31    // Register access protection

/*********************************************************************
*
*       Flash status register
*/
#define SR_EOP_BIT              0
#define SR_OPERR_BIT            1
#define SR_WRPERR_BIT           4
#define SR_PGAERR_BIT           5
#define SR_PGPERR_BIT           6
#define SR_PGSERR_BIT           7
#define SR_BUSY_BIT             16

/*********************************************************************
*
*       Flash unlock keys
*/
#define KEYR_KEY1               0x45670123
#define KEYR_KEY2               0xCDEF89AB

/*********************************************************************
*
*       Flash access control register
*/
#define ACR_ARTEN_BIT           9
#define ACR_ARTRST_BIT          11

/*********************************************************************
*
*       MPU defines
*/
#define CTRL_ENABLE_BIT         0
#define CTRL_PRIVDEFENA_BIT     2
#define RNR_REGION_MASK         0xFF
#define RASR_ENABLE_BIT         0
#define RASR_SIZE_BIT           1
#define RASR_TEX_BIT            19
#define RASR_AP_BIT             24
#define RASR_XN_BIT             28
#define RASR_AP_FULL            0x3uL
#define TYPE_DREGION_BIT        8
#define TYPE_DREGION_MASK       0xFFuL
#define RBAR_REGION_BIT         0
#define RBAR_REGION_MASK        0x1FuL
#define RBAR_VALID_BIT          5

/*********************************************************************
*
*       Misc. defines
*/
#define CCR_DC_BIT              16
#define OPTR_DBANK_BIT          29
#define MAX_SECTOR_BLOCKS       6   // Number regions with the same sector size.
#define BANK_INDEX_BIT          4
#define WAIT_TIMEOUT_CYCLES     200000000uL   // This is the number of cycles required to create a delay of about 7 seconds at a CPU frequency of 216 MHz

/*********************************************************************
*
*       ASSERT_SECTOR_INDEX_IS_IN_RANGE
*/
#if FS_DEBUG_LEVEL >= FS_DEBUG_LEVEL_CHECK_ALL
  #define ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex)                                \
    if (SectorIndex >= _NumSectorsUsed) {                                             \
      FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F767: Invalid sector index.\n")); \
      FS_X_PANIC(FS_ERRCODE_INVALID_PARA);                                            \
    }
#else
  #define ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex)
#endif

/*********************************************************************
*
*      Local data types
*
**********************************************************************
*/

/*********************************************************************
*
*      SECTOR_BLOCK
*
*  A sector block defines a number of adjacent sectors of the same size.
*  It therefor contains the size (of one sector) and number of sectors in the block.
*  The entire sectorization can be described with just a few sector blocks.
*/
typedef struct {
  U32 SectorSize;
  U32 NumSectors;
} SECTOR_BLOCK;

/*********************************************************************
*
*      Static const
*
**********************************************************************
*/
static const SECTOR_BLOCK _aSectorBlock2MB_DualBank[] = {
  {16  * 1024, 4},
  {64  * 1024, 1},
  {128 * 1024, 7},
  {16  * 1024, 4},
  {64  * 1024, 1},
  {128 * 1024, 7}
};

static const SECTOR_BLOCK _aSectorBlock2MB_SingleBank[] = {
  {32  * 1024, 4},
  {128 * 1024, 1},
  {256 * 1024, 7}
};

static const SECTOR_BLOCK _aSectorBlock1MB_DualBank[] = {
  {16  * 1024, 4},
  {64  * 1024, 1},
  {128 * 1024, 3},
  {16  * 1024, 4},
  {64  * 1024, 1},
  {128 * 1024, 3}
};

static const SECTOR_BLOCK _aSectorBlock1MB_SingleBank[] = {
  {32  * 1024, 4},
  {128 * 1024, 1},
  {256 * 1024, 3}
};

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
static U32                  _BaseAddr;                            // Address of the first byte of flash        (configured)
static U32                  _StartAddrConf;                       // Address of the first byte used as storage (configured)
static U32                  _NumBytesConf;                        // Number of bytes to be used as storage     (configured)
static U32                  _StartAddrUsed;                       // Start address actually used (aligned to start of a sector)
static SECTOR_BLOCK         _aSectorBlockUsed[MAX_SECTOR_BLOCKS]; // Sector blocks actually used as storage.
static const SECTOR_BLOCK * _paSectorBlockDevice;                 // Sector blocks of the actual device.
static U32                  _NumSectorBlocksDevice;               // Number of sector blocks in the actual device.
static U8                   _NumSectorBlocksUsed;                 // Number of sector blocks used as storage.
static U8                   _FirstSectorIndex;                    // Index of the first physical sector used for storage.
static U8                   _NumSectorsUsed;                      // Number of physical sectors used as storage.
static U8                   _SectorsPerBank;                      // Number of sectors in a bank.

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _ld
*/
static unsigned _ld(U32 Value) {
  unsigned i;

  for (i = 0; i < 32u; i++) {
    if ((1uL << i) == Value) {
      break;
    }
  }
  return i;
}

/*********************************************************************
*
*      _Lock
*
*  Function description
*    Locks access to flash control register.
*/
static void _Lock(void) {
  U32 TimeOut;

