jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32F767/FS_NOR_PHY_STM32F767.c
  FLASH_CR |= (1uL << CR_LOCK_BIT);
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((FLASH_CR & (1uL << CR_LOCK_BIT)) != 0u) {
      break;
    }
    if (--TimeOut == 0u) {
      break;
    }
  }
}

/*********************************************************************
*
*      _Unlock
*
*  Function description
*    Unlocks access to flash control register.
*/
static int _Unlock(void) {
  int IsLocked;
  U32 TimeOut;

  IsLocked = 0;
  if ((FLASH_CR & (1uL << CR_LOCK_BIT)) != 0u) {
    FLASH_KEYR = KEYR_KEY1;
    FLASH_KEYR = KEYR_KEY2;
    TimeOut = WAIT_TIMEOUT_CYCLES;
    for (;;) {
      if ((FLASH_CR & (1uL << CR_LOCK_BIT)) == 0u) {
        IsLocked = 1;
        break;
      }
      if (--TimeOut == 0u) {
        break;
      }
    }
  }
  return IsLocked;
}

/*********************************************************************
*
*      _InvalidateCache
*/
static void _InvalidateCache(void) {
  if (FLASH_ACR & (1uL << ACR_ARTEN_BIT)) {    // Data cache enabled?
    FLASH_ACR &= ~(1uL << ACR_ARTEN_BIT);      // Disable data cache in order to invalidate it.
    FLASH_ACR |=   1uL << ACR_ARTRST_BIT;
    FLASH_ACR &= ~(1uL << ACR_ARTRST_BIT);
    FLASH_ACR |=   1uL << ACR_ARTEN_BIT;       // Re-enable data cache.
  }
}

/*********************************************************************
*
*      _CalcParallelism
*/
static U32 _CalcParallelism(U32 NumBytes) {
  switch (NumBytes) {
  default:
    // through
  case 1:
    return CR_PSIZE_8;
  case 2:
    return CR_PSIZE_16;
  case 4:
    return CR_PSIZE_32;
  }
}

/*********************************************************************
*
*      _EnableProgram
*
*  Function description
*    Starts a programming operation.
*/
static void _EnableProgram(U32 NumBytes) {
  U32 Parallelism;

  Parallelism = _CalcParallelism(NumBytes);
  //
  // Clear all error flags.
  //
  FLASH_SR = 0
           | (1uL << SR_WRPERR_BIT)
           | (1uL << SR_PGAERR_BIT)
           | (1uL << SR_PGPERR_BIT)
           | (1uL << SR_PGSERR_BIT)
           ;
  FLASH_CR &= ~(CR_PSIZE_MASK << CR_PSIZE_BIT);
  FLASH_CR |= Parallelism << CR_PSIZE_BIT;
  __DSB();                // Make sure that the data is written to register.
  FLASH_CR |= 1uL         << CR_PG_BIT;
  __DSB();                // Make sure that the data is written to register.
}

/*********************************************************************
*
*      _DisbleProgram
*
*  Function description
*    Ends a programming operation.
*/
static void _DisableProgram(void) {
  FLASH_CR &= ~((1uL           << CR_PG_BIT) |
                (CR_PSIZE_MASK << CR_PSIZE_BIT));
}

/*********************************************************************
*
*      _StartErase
*
*  Function description
*    Starts the execution of an erase operation.
*/
static void _StartErase(unsigned SectorIndex) {
  U32 Parallelism;

  Parallelism = _CalcParallelism(FS_NOR_PHY_MAX_NUM_BYTES);
  //
  // Clear all error flags.
  //
  FLASH_SR = 0
           | (1uL << SR_WRPERR_BIT)
           | (1uL << SR_PGAERR_BIT)
           | (1uL << SR_PGPERR_BIT)
           | (1uL << SR_PGSERR_BIT)
           ;
  //
  // Set flash controller to sector erase mode and select sector to be erased.
  //
  FLASH_CR &= ~((CR_SNB_MASK   << CR_SNB_BIT) |
                (CR_PSIZE_MASK << CR_PSIZE_BIT));
  FLASH_CR |= 0
           | (1uL         << CR_SER_BIT)
           | (SectorIndex << CR_SNB_BIT)
           | (Parallelism << CR_PSIZE_BIT)
           ;
  //
  // Start erasing.
  //
  FLASH_CR |= 1uL << CR_STRT_BIT;
  __DSB();                // Make sure that the data is written to register.
}

/*********************************************************************
*
*      _CompleteErase
*
*   Function description
*     Ends the execution of an erase operation.
*/
static void _CompleteErase(void) {
  FLASH_CR &= ~((1uL           << CR_SER_BIT) |
                (CR_SNB_MASK   << CR_SNB_BIT) |
                (CR_PSIZE_MASK << CR_PSIZE_BIT));
}

/*********************************************************************
*
*      _WaitForEndOfOperation
*
*   Function description
*     Waits until a flash operation completes.
*
*/
static int _WaitForEndOfOperation(void) {
  U32 Status;
  int r;
  U32 TimeOut;

  r = 1;    // Set to indicate an error.
  //
  // Wait for the operation to complete
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = FLASH_SR;
    if ((Status & (1uL << SR_BUSY_BIT)) == 0u) {
      break;
    }
    if (--TimeOut == 0u) {
      break;
    }
  }
  //
  // OK, operation completed. Check the result.
  //
  if (Status & (1uL << SR_WRPERR_BIT)) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F767: Flash operation failed (Flash is write-protected).\n"));
  } else if (Status & (1uL << SR_PGAERR_BIT)) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F767: Flash operation failed (Access not aligned).\n"));
  } else if (Status & (1uL << SR_PGPERR_BIT)) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F767: Flash operation failed (Invalid number of bytes).\n"));
  } else if (Status & (1uL << SR_PGSERR_BIT)) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F767: Flash operation failed (Invalid configuration).\n"));
  } else if (TimeOut == 0u) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F767: Flash operation failed (Timeout).\n"));
  } else {
    r = 0;
  }
  return r;
}

/*********************************************************************
*
*      _WriteOff8
*/
static int _WriteOff8(U32 Off, const U8 * pData, U32 NumBytes) {
  U8  * pWrite;
  U32   StartAddr;
  int   r;
  int   IsLocked;

  r         = 0;              // Set to indicate success.
  StartAddr = _StartAddrUsed + Off;
  pWrite    = SEGGER_ADDR2PTR(U8, StartAddr);
  IsLocked  = _Unlock();
  _EnableProgram(1);
  do {
    *pWrite++ = *pData++;
    __DSB();                  // Wait until the data is written. Without this the write operation may occasionally fail with PGPERR set.
    r = _WaitForEndOfOperation();
    if (r != 0) {
      r = 1;                  // Error, operation failed.
      break;
    }
  } while (--NumBytes != 0u);
  _DisableProgram();
  if (IsLocked != 0) {
    _Lock();
  }
  return r;
}

#if (FS_NOR_PHY_MAX_NUM_BYTES >= 2)

/*********************************************************************
*
*      _WriteOff16
*/
static int _WriteOff16(U32 Off, const U16 * pData, U32 NumItems) {
  U16 * pWrite;
  U32   StartAddr;
  int   r;
  int   IsLocked;

  r         = 0;              // Set to indicate success.
  StartAddr = _StartAddrUsed + Off;
  pWrite    = SEGGER_ADDR2PTR(U16, StartAddr);
  IsLocked  = _Unlock();
  _EnableProgram(2);
  do {
    *pWrite++ = *pData++;
    __DSB();                  // Wait until the data is written. Without this the write operation may occasionally fail with PGPERR set.
    r = _WaitForEndOfOperation();
    if (r != 0) {
      r = 1;                  // Error, operation failed.
      break;
    }
  } while (--NumItems != 0u);
  _DisableProgram();
  if (IsLocked != 0) {
    _Lock();
  }
  return r;
}

