jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32F767/FS_NOR_PHY_STM32F767.c
#endif // FS_NOR_PHY_MAX_NUM_BYTES >= 2

#if (FS_NOR_PHY_MAX_NUM_BYTES >= 4)

/*********************************************************************
*
*      _WriteOff32
*/
static int _WriteOff32(U32 Off, const U32 * pData, U32 NumItems) {
  U32 * pWrite;
  U32   StartAddr;
  int   r;
  int   IsLocked;

  r         = 0;              // Set to indicate success.
  StartAddr = _StartAddrUsed + Off;
  pWrite    = SEGGER_ADDR2PTR(U32, StartAddr);
  IsLocked  = _Unlock();
  _EnableProgram(4);
  do {
    *pWrite++ = *pData++;
    __DSB();                  // Wait until the data is written. Without this the write operation may occasionally fail with PGPERR set.
    r = _WaitForEndOfOperation();
    if (r != 0) {
      r = 1;                  // Error, operation failed.
      break;
    }
  } while (--NumItems != 0u);
  _DisableProgram();
  if (IsLocked != 0) {
    _Lock();
  }
  return r;
}

#endif // FS_NOR_PHY_MAX_NUM_BYTES >= 4

/*********************************************************************
*
*      _WriteOff
*/
static int _WriteOff(U32 Off, const U8 * pData, U32 NumBytes) {
  int r;

  r = 0;             // Set to indicate success.
#if (FS_NOR_PHY_MAX_NUM_BYTES == 2)
  if ((Off & 1u) == (SEGGER_PTR2ADDR(pData) & 1u)) {
    if (NumBytes != 0) {
      if ((SEGGER_PTR2ADDR(pData) & 1u) != 0) {
        //
        // Write the leading unaligned byte.
        //
        r = _WriteOff8(Off, pData, 1);
        if (r != 0) {
          NumBytes = 0;                                 // Error, could not write data.
        } else {
          ++pData;
          ++Off;
          --NumBytes;
        }
      }
    }
    if (NumBytes != 0) {
      U32 NumItems;

      NumItems = NumBytes >> 1;
      if (NumItems != 0) {
        //
        // Write entire words.
        //
        r = _WriteOff16(Off, SEGGER_PTR2PTR(const U16, pData), NumItems);
        if (r != 0) {
          NumBytes = 0;                                 // Error, could not write data.
        } else {
          pData    += NumItems << 1;
          Off      += NumItems << 1;
          NumBytes -= NumItems << 1;
        }
      }
    }
  }
#endif // FS_NOR_PHY_MAX_NUM_BYTES == 2
#if (FS_NOR_PHY_MAX_NUM_BYTES == 4)
  if ((Off & 3u) == (SEGGER_PTR2ADDR(pData) & 3u)) {
    if (NumBytes != 0) {
      if ((SEGGER_PTR2ADDR(pData) & 1u) != 0) {
        //
        // Write the leading unaligned byte.
        //
        r = _WriteOff8(Off, pData, 1);
        if (r != 0) {
          NumBytes = 0;                                 // Error, could not write data.
        } else {
          ++pData;
          ++Off;
          --NumBytes;
        }
      }
    }
    if (NumBytes != 0) {
      if ((SEGGER_PTR2ADDR(pData) & 3u) != 0) {
        //
        // Write the leading unaligned half-word.
        //
        r = _WriteOff16(Off, SEGGER_PTR2PTR(const U16, pData), 1);
        if (r != 0) {
          NumBytes = 0;                                 // Error, could not write data.
        } else {
          pData    += 2;
          Off      += 2;
          NumBytes -= 2;
        }
      }
    }
    if (NumBytes != 0) {
      U32 NumItems;

      NumItems = NumBytes >> 2;
      if (NumItems != 0) {
        //
        // Write entire words.
        //
        r = _WriteOff32(Off, SEGGER_PTR2PTR(const U32, pData), NumItems);
        if (r != 0) {
          NumBytes = 0;                                 // Error, could not write data.
        } else {
          pData    += NumItems << 2;
          Off      += NumItems << 2;
          NumBytes -= NumItems << 2;
        }
      }
    }
    if (NumBytes >= 2) {
      //
      // Write the trailing unaligned half-word.
      //
      r = _WriteOff16(Off, SEGGER_PTR2PTR(const U16, pData), 1);
      if (r != 0) {
        NumBytes = 0;                                 // Error, could not write data.
      } else {
        pData    += 2;
        Off      += 2;
        NumBytes += 2;
      }
    }
  }
#endif // FS_NOR_PHY_MAX_NUM_BYTES == 4
  if (NumBytes != 0) {
    r = _WriteOff8(Off, pData, NumBytes);
  }
  return r;
}

/*********************************************************************
*
*      _GetSectorOff
*/
static U32 _GetSectorOff(unsigned SectorIndex) {
  unsigned i;
  unsigned NumBlocks;
  unsigned NumSectors;
  U32      SectorSize;
  U32      Off;

  NumBlocks = _NumSectorBlocksUsed;
  Off = 0;
  for (i = 0; i < NumBlocks; i++) {
    NumSectors = _aSectorBlockUsed[i].NumSectors;
    SectorSize = _aSectorBlockUsed[i].SectorSize;
    if (SectorIndex < NumSectors) {
      NumSectors = SectorIndex;
    }
    Off += NumSectors * SectorSize;
    SectorIndex -= NumSectors;   // Number of remaining sectors
  }
  return Off;
}

/*********************************************************************
*
*      _GetSectorSize
*/
static U32 _GetSectorSize(unsigned SectorIndex) {
  unsigned i;
  unsigned NumBlocks;
  unsigned NumSectors;
  U32      SectorSize;

  NumBlocks = _NumSectorBlocksUsed;
  for (i = 0; i < NumBlocks; i++) {
    NumSectors = _aSectorBlockUsed[i].NumSectors;
    SectorSize = _aSectorBlockUsed[i].SectorSize;
    if (SectorIndex < NumSectors) {
      return SectorSize;
    }
    SectorIndex -= NumSectors;   // Number of remaining sectors
  }
  return 0;                      // Invalid sector index. Should not happen.
}

/*********************************************************************
*
*      _CalcStorageArea
*
*  Function description
*    Determines which physical sectors are used as storage.
*/
static int _CalcStorageArea(void) {
  U32            NumSectorBlocks;
  U8             NumSectorBlocksUsed;
  U32            NumBytesToSkip;
  U32            NumBytesRem;
  U32            NumSectorsUsed;
  U32            NumBytesSkipped;
  U32            i;
  U32            BaseAddr;
  U32            StartAddrUsed;
  U32            SectorIndex;
  U8             FirstSectorIndex;
  SECTOR_BLOCK * pSectorBlockUsed;

  //
  // Read physical sector block information and add it to the list of used blocks
  //
  NumSectorBlocks     = _NumSectorBlocksDevice;
  NumSectorBlocksUsed = 0;
  NumSectorsUsed      = 0;
  NumBytesSkipped     = 0;
  BaseAddr            = _BaseAddr;
  NumBytesToSkip      = _StartAddrConf - BaseAddr;
  NumBytesRem         = _NumBytesConf;
  StartAddrUsed       = 0;
  pSectorBlockUsed    = _aSectorBlockUsed;
  SectorIndex         = 0;
  FirstSectorIndex    = 0;
  for (i = 0; i < NumSectorBlocks; i++) {
    U32 NumSectors;
    U32 SectorSize;

    NumSectors = _paSectorBlockDevice[i].NumSectors;
    SectorSize = _paSectorBlockDevice[i].SectorSize;
    //
    // Take care of bytes to skip before data area.
    //
    while (NumSectors && (NumBytesToSkip > 0)) {
      if (NumBytesToSkip > SectorSize) {
        NumBytesToSkip  -= SectorSize;
      } else {
        NumBytesToSkip   = 0;
      }
      NumBytesSkipped += SectorSize;
      NumSectors--;
      SectorIndex++;
    }
    if (NumSectors) {
      U32 NumSectorsRem;

      NumSectorsRem = NumBytesRem / SectorSize;
      if (NumSectors > NumSectorsRem) {
        NumSectors  = NumSectorsRem;
        NumBytesRem = 0;      // No more sectors after this to make sure that the sectors are adjacent!
      } else {
        NumBytesRem -= NumSectors * SectorSize;
      }
      //
      // Take care of bytes to skip after data area.
      //
      if (NumSectors) {
        if (NumSectorBlocksUsed == 0) {
          StartAddrUsed    = BaseAddr + NumBytesSkipped;      // Remember address of first sector used.
          FirstSectorIndex = SectorIndex;
        }
        pSectorBlockUsed->SectorSize = SectorSize;
        pSectorBlockUsed->NumSectors = NumSectors;
        ++NumSectorBlocksUsed;
        ++pSectorBlockUsed;
        NumSectorsUsed += NumSectors;
      }
    }
  }
  _NumSectorBlocksUsed = NumSectorBlocksUsed;
  _NumSectorsUsed      = NumSectorsUsed;
  _StartAddrUsed       = StartAddrUsed;
  _FirstSectorIndex    = FirstSectorIndex;
  //
  // Perform a sanity check.
  //
  if (NumSectorBlocksUsed == 0) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F767: Flash size to small for this configuration."));
    return 1;
  }
  return 0;
}

/*********************************************************************
*
*      _CalcBRSI
*
*  Function description
*    Calculates the sector index relative to a bank.
*/
static U32 _CalcBRSI(U32 SectorIndex) {
  SectorIndex += _FirstSectorIndex;
  if (SectorIndex >= _SectorsPerBank) {
    SectorIndex -= _SectorsPerBank;
    SectorIndex |= 1u << BANK_INDEX_BIT;
  }
  return SectorIndex;
}

/*********************************************************************
*
*      _CalcNumSectors
*
*  Function description
*    Calculates the total number of sectors in device.
*/
static unsigned _CalcNumSectors(const SECTOR_BLOCK * pSectorBlock, unsigned NumSectorBlocks) {
  unsigned NumSectors;
  unsigned i;

  NumSectors = 0;
  for (i = 0; i < NumSectorBlocks; ++i) {
    NumSectors += pSectorBlock->NumSectors;
    ++pSectorBlock;
  }
  return NumSectors;
}

/*********************************************************************
*
*       _DisableDCache
*/
static void _DisableDCache(void) {
  U32 NumRegions;
  U32 iRegion;
  U32 Mask;
  U32 ldNumBytes;

