jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32F767/FS_NOR_PHY_STM32F767.c
  if (SCB_CCR & (1uL << CCR_DC_BIT)) {      // Is data cache enabled?
    NumRegions = (MPU_TYPE >> TYPE_DREGION_BIT) & TYPE_DREGION_MASK;
    //
    // Find the next free region.
    //
    for (iRegion = 0; iRegion < NumRegions; ++iRegion) {
      MPU_RNR = iRegion;
      if ((MPU_RASR & (1uL << RASR_ENABLE_BIT)) == 0) {
        break;            // Found a free region.
      }
      //
      // Check if we already configured the MPU.
      //
      Mask = 0uL
           | (RBAR_REGION_MASK << RBAR_REGION_BIT)
           | (1uL              << RBAR_VALID_BIT)
           ;
      if ((MPU_RBAR & ~Mask) == _StartAddrConf) {
        iRegion = NumRegions;
        break;            // Already configured.
      }
    }
    if (iRegion < NumRegions) {
      ldNumBytes = _ld(_NumBytesConf);
      //
      // Use MPU to disable the data cache on the memory region assigned to internal flash.
      //
      MPU_CTRL &= ~(1uL << CTRL_ENABLE_BIT);      // Disable MPU first.
      MPU_RNR   = iRegion & RNR_REGION_MASK;
      MPU_RBAR  = _StartAddrConf;
      MPU_RASR  = 0
                | (1uL              << RASR_XN_BIT)
                | (RASR_AP_FULL     << RASR_AP_BIT)
                | (1uL              << RASR_TEX_BIT)
                | ((ldNumBytes - 1) << RASR_SIZE_BIT)
                | (1uL              << RASR_ENABLE_BIT)
                ;
      //
      // Enable MPU.
      //
      MPU_CTRL |= 0
               | (1uL << CTRL_PRIVDEFENA_BIT)
               | (1uL << CTRL_ENABLE_BIT)
               ;
    }
  }
}

/*********************************************************************
*
*      Public code (through callback)
*
**********************************************************************
*/

/*********************************************************************
*
*      _PHY_WriteOff
*
*  Function description
*    This routine writes data into any section of the flash.
*
*  Return value
*    ==0    O.K., data has been written
*    !=0    An error occurred
*
*  Parameters
*    Unit         Index of the physical layer.
*    Off          Byte offset relative to beginning of the region
*                 used as storage where to store the first byte.
*    pData        [OUT] Data to be written to storage device.
*    NumBytes     Number of bytes to be written.
*
*  Additional information
*    This function does not check if the section to be written
*    has been previously erased. This is in the responsibility
*    of the NOR driver. It has to be able to write data into
*    multiple sectors at a time.
*/
static int _PHY_WriteOff(U8 Unit, U32 Off, const void * pData, U32 NumBytes) {
  int r;

  FS_USE_PARA(Unit);
  r = 0;                  // OK, data written to flash.
  if (NumBytes != 0u) {
    r = _WriteOff(Off, pData, NumBytes);
  }
  return r;
}

/*********************************************************************
*
*       _PHY_ReadOff
*
*  Function description
*    Reads a number of bytes from the specified byte offset.
*
*  Parameters
*    Unit         Index of the physical layer.
*    pData        [OUT] Data read from storage device.
*    Off          Byte offset relative to beginning of the region
*                 used as storage of the first byte to be read.
*    NumBytes     Number of bytes to be read.
*
*  Return value
*    ==0    O.K., data has been read from flash.
*    !=0    An error occurred.
*/
static int _PHY_ReadOff(U8 Unit, void * pData, U32 Off, U32 NumBytes) {
  U32 ReadAddr;
  U32 StartAddr;

  FS_USE_PARA(Unit);
  StartAddr = _StartAddrUsed;
  ReadAddr  = StartAddr + Off;
  FS_MEMCPY(pData, (U8 *)ReadAddr, NumBytes);
  return 0;               // OK, data read from flash.
}

/*********************************************************************
*
*      _PHY_EraseSector
*
*  Function description
*    Erases one physical sector.
*
*  Parameters
*    Unit         Index of the physical layer.
*    SectorIndex  Index of the physical sector to be erased.
*
*  Return value
*    ==0    OK, sector was successfully erased.
*    !=0    Error, sector could not be erased.
*
*  Additional information
*    SectorIndex is relative to the StartAddr configured
*    by the application via _PHY_Configure(). The the sector
*    located at the address StartAddr has the index 0,
*    the index of the sector located at StartAddr + SectorSize
*    has the index 1 and so on.
*/

static int _PHY_EraseSector(U8 Unit, unsigned int SectorIndex) {
  int r;
  int IsLocked;

  FS_USE_PARA(Unit);
  ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex);
  SectorIndex = _CalcBRSI(SectorIndex);
  (void)_WaitForEndOfOperation();
  IsLocked = _Unlock();
  _StartErase(SectorIndex);
  r = _WaitForEndOfOperation();
  _CompleteErase();
  _InvalidateCache();         // Invalidate the cache to ensure data consistency.
  if (IsLocked != 0) {
    _Lock();
  }
  return r;
}

/*********************************************************************
*
*       _PHY_GetSectorInfo
*
*  Function description
*    Returns the parameters of the specified physical sector.
*
*  Parameters
*    Unit         Index of the physical layer.
*    SectorIndex  Index of the physical sector relative to the first
*                 sector used a storage.
*    pOff         [OUT] Offset of the first byte in the physical sector
*                 relative to beginning of the region used as storage.
*                 pOff is set to NULL if the NOR driver does not require
*                 this parameter.
*    pLen         [OUT] Number of bytes in the specified physical sector.
*                 pLen is set to NULL if the NOR driver does not require
*                 this parameter.
*
*  Additional information
*    SectorIndex can be different than the index of the actual physical
*    sector if a StartAddr larger than BaseAddr is specified in the call
*    to _PHY_Configure().
*    The NOR driver can request either both parameters or only one of them.
*/
static void _PHY_GetSectorInfo(U8 Unit, unsigned int SectorIndex, U32 * pOff, U32 * pLen) {
  U32 SectorOff;
  U32 SectorSize;

  FS_USE_PARA(Unit);
  //
  // Fail if the SectorIndex is out of bounds or the device parameters are not set.
  //
  ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex);
  //
  // Compute result.
  //
  SectorSize = _GetSectorSize(SectorIndex);
  SectorOff  = _GetSectorOff(SectorIndex);
  if (pOff) {
    *pOff = SectorOff;
  }
  if (pLen) {
    *pLen = SectorSize;
  }
}

/*********************************************************************
*
*       _PHY_GetNumSectors
*
*  Function description
*    Returns the number of physical sectors that can be used for data storage.
*
*  Parameters
*    Unit         Index of the physical layer.
*
*  Additional information
*    The number of sectors can be smaller than the total number of
*    sectors in the storage device if _PHY_Configure() is called with StartAddr
*    larger than BaseAddr or NumBytes is smaller than the total capacity
*    of the storage device.
*/
static int _PHY_GetNumSectors(U8 Unit) {
  int r;

  FS_USE_PARA(Unit);
  r = _NumSectorsUsed;
  return r;
}

/*********************************************************************
*
*       _PHY_Configure
*
*  Function description
*    Configures a single instance of the driver
*
*  Parameters
*    Unit         Index of the physical layer.
*    BaseAddr     Address of the first byte in the storage device.
*    StartAddr    Address of the first byte to be used as storage.
*    NumBytes     Number of bytes to be used as storage.
*
*  Additional information
*    If required, the function is responsible to align StartAddr
*    and NumBytes to a physical sector boundary. StartAddr has to
*    be aligned to the next ascending physical sector boundary.
*    NumBytes has to be aligned to the next descending physical
*    sector boundary.
*/
static void _PHY_Configure(U8 Unit, U32 BaseAddr, U32 StartAddr, U32 NumBytes) {
  FS_USE_PARA(Unit);
  FS_DEBUG_ASSERT(FS_MTYPE_DRIVER, StartAddr >= BaseAddr);
  _BaseAddr      = BaseAddr;
  _StartAddrConf = StartAddr;
  _NumBytesConf  = NumBytes;
  //
  // Disable the cache on the flash region used as storage.
  //
  _DisableDCache();
}

/*********************************************************************
*
*       _PHY_OnSelectPhy
*
*  Function description
*    This function is called during the initialization after
*    this physical layer is assigned to NOR driver.
*
*  Parameters
*    Unit         Index of the physical layer.
*
*  Additional information
*    This is the place where physical layer can get information
*    about the storage device.
*/
static void _PHY_OnSelectPhy(U8 Unit) {
  FS_USE_PARA(Unit);
  //
  // Nothing to do here.
  //
}

/*********************************************************************
*
*       _PHY_Init
*
*  Function description
*    Initializes the physical layer.
*
*  Parameters
*    Unit         Index of the physical layer.
*
*  Return value
*    ==0      OK, physical layer initialized.
*    !=0      An error occurred.
*
*  Additional information
*    This function is optional. If not present, the physical layer
*    has to be initialized at the first call to one of the following
*    functions:
*    - _PHY_WriteOff
*    - _PHY_ReadOff
*    - _PHY_EraseSector
*    - _PHY_GetSectorInfo
*    - _PHY_GetNumSectors
*/
static int _PHY_Init(U8 Unit) {
  U32 FlashSize;
  int r;
  int IsDualBank;
  U32 NumSectors;

  FS_USE_PARA(Unit);
  //
  // Determine the characteristics of the internal flash memory.
  //
  FlashSize   = SYS_FSIZE;                        // The flash size register stores the number of Kbytes.
  FlashSize <<= 10;                               // Calculate the total number of bytes in the internal flash memory.
  //
  // Check for dual-bank configuration.
  //
  IsDualBank = 0;
  if ((FLASH_OPTCR & (1uL << OPTR_DBANK_BIT)) == 0u) {
    IsDualBank = 1;
  }
  //
  // Select the correct flash organization.
  //
  if (IsDualBank != 0) {
    if (FlashSize > 0x000100000) {
      _paSectorBlockDevice   = _aSectorBlock2MB_DualBank;
      _NumSectorBlocksDevice = SEGGER_COUNTOF(_aSectorBlock2MB_DualBank);
    } else {
      _paSectorBlockDevice   = _aSectorBlock1MB_DualBank;
      _NumSectorBlocksDevice = SEGGER_COUNTOF(_aSectorBlock1MB_DualBank);
    }
  } else {
    if (FlashSize > 0x000100000) {
      _paSectorBlockDevice   = _aSectorBlock2MB_SingleBank;
      _NumSectorBlocksDevice = SEGGER_COUNTOF(_aSectorBlock2MB_SingleBank);
    } else {
      _paSectorBlockDevice   = _aSectorBlock1MB_SingleBank;
      _NumSectorBlocksDevice = SEGGER_COUNTOF(_aSectorBlock1MB_SingleBank);
    }
  }
  //
  // Calculate the number of sectors in a bank.
  //
  NumSectors = _CalcNumSectors(_paSectorBlockDevice, _NumSectorBlocksDevice);
  if (IsDualBank != 0) {
    NumSectors >>= 1;
  }
  _SectorsPerBank = NumSectors;
  //
  // Calculate which sectors are used as storage.
  //
  r = _CalcStorageArea();
  return r;
}

/*********************************************************************
*
*       Global data
*
**********************************************************************
*/

/*********************************************************************
*
*       FS_NOR_PHY_STM32F767
*/
const FS_NOR_PHY_TYPE FS_NOR_PHY_STM32F767 = {
  _PHY_WriteOff,
  _PHY_ReadOff,
  _PHY_EraseSector,
  _PHY_GetSectorInfo,
  _PHY_GetNumSectors,
  _PHY_Configure,
  _PHY_OnSelectPhy,
  NULL,
  NULL,
  _PHY_Init
};

/*************************** End of file ****************************/
